---
title: OpeningFailures
classe: Autodesk.Revit.DB.BuiltInFailures+OpeningFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# OpeningFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId HostForCutHasNoGeometry { get; }` | `OpeningFailures.HostForCutHasNoGeometry` | FailureDefinitionId |
| `FailureDefinitionId HostForCutHasNoGeometryWarn { get; }` | `OpeningFailures.HostForCutHasNoGeometryWarn` | FailureDefinitionId |
| `FailureDefinitionId InvalidComplexCut { get; }` | `OpeningFailures.InvalidComplexCut` | FailureDefinitionId |
| `FailureDefinitionId ModelAlreadyCheckedOutByUser { get; }` | `OpeningFailures.ModelAlreadyCheckedOutByUser` | FailureDefinitionId |
| `FailureDefinitionId OpeningCutAll { get; }` | `OpeningFailures.OpeningCutAll` | FailureDefinitionId |
| `FailureDefinitionId OpeningDoesnotCutHost { get; }` | `OpeningFailures.OpeningDoesnotCutHost` | FailureDefinitionId |
| `FailureDefinitionId OpeningDoesnotCutHostDelete { get; }` | `OpeningFailures.OpeningDoesnotCutHostDelete` | FailureDefinitionId |
| `FailureDefinitionId OpeningNegativeHeight { get; }` | `OpeningFailures.OpeningNegativeHeight` | FailureDefinitionId |
| `FailureDefinitionId OpeningPartiallyCutsHost { get; }` | `OpeningFailures.OpeningPartiallyCutsHost` | FailureDefinitionId |
| `FailureDefinitionId OpeningRectDoesnotCutHost { get; }` | `OpeningFailures.OpeningRectDoesnotCutHost` | FailureDefinitionId |
| `FailureDefinitionId OpeningRemovesHost { get; }` | `OpeningFailures.OpeningRemovesHost` | FailureDefinitionId |
| `FailureDefinitionId OpenStringerConflictNosing { get; }` | `OpeningFailures.OpenStringerConflictNosing` | FailureDefinitionId |
| `FailureDefinitionId PropertyNotClosed { get; }` | `OpeningFailures.PropertyNotClosed` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```